results_api/log_3.5x32_single.txt
WARNING 10-05 11:21:11 _custom_ops.py:18] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url=None, host='216.81.245.84', port=30301, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='./ShareGPT_V3_unfiltered_cleaned_split.json', model='meta-llama/Meta-Llama-3-8B-Instruct', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=20480, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, request_rate=3.5, seed=0, trust_remote_code=False, disable_tqdm=False, save_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 3.5
============ Serving Benchmark Result ============
Successful requests:                     7044      
Benchmark duration (s):                  6000.84   
Total input tokens:                      1560837   
Total generated tokens:                  1316797   
Request throughput (req/s):              1.17      
Input token throughput (tok/s):          260.10    
Output token throughput (tok/s):         219.44    
---------------Time to First Token----------------
Mean TTFT (ms):                          105787.39 
Median TTFT (ms):                        113852.45 
P99 TTFT (ms):                           157927.70 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          116.44    
Median TPOT (ms):                        100.56    
P99 TPOT (ms):                           397.88    
---------------Inter-token Latency----------------
Mean ITL (ms):                           101.05    
Median ITL (ms):                         73.56     
P99 ITL (ms):                            545.41    
==================================================